## Plan Result (dts_cftsbox_intsvc_acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0] must be replaced
-/+ resource "azurerm_role_assignment" "app-proxy-ga-service-connection-certificate-management" {
      ~ id                               = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-platform-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/acmedtscftsboxintsvc/providers/Microsoft.Authorization/roleAssignments/040d3533-b9d8-7867-d5fc-cf6b11701e4c" -> (known after apply)
      ~ name                             = "040d3533-b9d8-7867-d5fc-cf6b11701e4c" -> (known after apply)
      ~ principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> "dad693c4-36ad-468f-94e9-76faa4bc844b" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Authorization/roleDefinitions/a4417e6f-fecd-4de8-b567-7b0420556985" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"","Target":"dts_cftsbox_intsvc_acme","Vars":{}} -->